public/journal/2024-08-25/index.html
<!DOCTYPE html>
<html lang="en-us">

<head>
  <meta http-equiv="X-Clacks-Overhead" content="GNU Terry Pratchett" />
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0" />
<title>A Lodge on Ashland Street | Genevieve&#39;s Journal</title>
<meta name="title" content="A Lodge on Ashland Street" />
<meta name="description" content="Geisthall We have shrinking/growing intradimensional wardrobes It&#39;s like the purses, but it can expand/shrink We can only enlarge it thrice a day, and only shrink it thrice a day I have one of the baby portals For Edalyn An object from before the Nex/Geb war A gift from an archmage&#39;s lieutenant to a bloodlord It lets vampires eat food For Fennec Bitter Retort, a ranged revolver which deals &#43;1d4 damage if you insult someone along with the attack Talking to the house I missed this part" />
<meta name="author" content="" />
<meta name="keywords" content="" />






  
  <meta property="og:url" content="https://vivianwilde.github.io/blogletters/journal/2024-08-25/">
  <meta property="og:site_name" content="Genevieve&#39;s Journal">
  <meta property="og:title" content="A Lodge on Ashland Street">
  <meta property="og:description" content="Geisthall We have shrinking/growing intradimensional wardrobes It&#39;s like the purses, but it can expand/shrink We can only enlarge it thrice a day, and only shrink it thrice a day I have one of the baby portals For Edalyn An object from before the Nex/Geb war A gift from an archmage&#39;s lieutenant to a bloodlord It lets vampires eat food For Fennec Bitter Retort, a ranged revolver which deals &#43;1d4 damage if you insult someone along with the attack Talking to the house I missed this part">
  <meta property="og:locale" content="en_us">
  <meta property="og:type" content="article">
    <meta property="article:section" content="journal">
    <meta property="article:published_time" content="2024-08-25T16:22:07-07:00">
    <meta property="article:modified_time" content="2024-08-25T16:22:07-07:00">


  
  
  <meta name="twitter:card" content="summary">
  <meta name="twitter:title" content="A Lodge on Ashland Street">
  <meta name="twitter:description" content="Geisthall We have shrinking/growing intradimensional wardrobes It&#39;s like the purses, but it can expand/shrink We can only enlarge it thrice a day, and only shrink it thrice a day I have one of the baby portals For Edalyn An object from before the Nex/Geb war A gift from an archmage&#39;s lieutenant to a bloodlord It lets vampires eat food For Fennec Bitter Retort, a ranged revolver which deals &#43;1d4 damage if you insult someone along with the attack Talking to the house I missed this part">


  
  
  <meta itemprop="name" content="A Lodge on Ashland Street">
  <meta itemprop="description" content="Geisthall We have shrinking/growing intradimensional wardrobes It&#39;s like the purses, but it can expand/shrink We can only enlarge it thrice a day, and only shrink it thrice a day I have one of the baby portals For Edalyn An object from before the Nex/Geb war A gift from an archmage&#39;s lieutenant to a bloodlord It lets vampires eat food For Fennec Bitter Retort, a ranged revolver which deals &#43;1d4 damage if you insult someone along with the attack Talking to the house I missed this part">
  <meta itemprop="datePublished" content="2024-08-25T16:22:07-07:00">
  <meta itemprop="dateModified" content="2024-08-25T16:22:07-07:00">
  <meta itemprop="wordCount" content="1551">

<meta name="referrer" content="no-referrer-when-downgrade" />

  
  <link href="/blogletters/original.min.css" rel="stylesheet">

  

  

  
</head>

<body>
  <header><a class="skip-link" href="#main-content">Skip to main content</a>

<a href="/blogletters/" class="title"><h1>Genevieve&#39;s Journal</h1></a>
<nav>
  <a href="/blogletters/journal">Journal</a>

  <a href="/blogletters/threads">Quest Threads</a>

  <a href="/blogletters/about">About</a>









</nav>
</header>
  <main id="main-content">

<h1>A Lodge on Ashland Street</h1>
<p class="byline">
  <time datetime='2024-08-25' pubdate>
    2024-08-25
  </time>
  
</p>

<content>
  
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Geisthall
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<ul>
<li>We have shrinking/growing intradimensional wardrobes</li>
<li>It&#39;s like the purses, but it can expand/shrink</li>
<li>We can only enlarge it thrice a day, and only shrink it thrice a day</li>
<li>I have one of the baby portals</li>
</ul>
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
For Edalyn
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<ul>
<li>An object from before the Nex/Geb war</li>
<li>A gift from an archmage&#39;s lieutenant to a bloodlord</li>
<li>It lets vampires eat food</li>
</ul>
</div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
For Fennec
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<ul>
<li>Bitter Retort, a ranged revolver which deals +1d4 damage if you insult someone along with the attack</li>
</ul>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Talking to the house
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>I missed this part</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Truenaming
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<ul>
<li>Thulvia has some people in the Alchemists&#39; Citadel who might know what&#39;s up</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
Bat and Mouse
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<ul>
<li>Mouse is crazy and anti-vampire, and insane</li>
<li>Bat is chill and not a vampire</li>
</ul>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Mosquito Witch (Rumors)
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<ul>
<li>Powerful vampire who uses mosquitos to harvest blood</li>
<li>Priestess/cultist of some evil god</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
Thulvia
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<ul>
<li>It&#39;s basically a country. We&#39;re</li>
<li>Alchemist&#39;s Citadel: School, library, stronghold</li>
<li>Elixir of the Sun Orchid: Immortality potion</li>
<li>Could it be useful in undoing vampirism?</li>
<li>A master alchemist has lived here for 500 years (so may remember things)</li>
<li>Lives in the deepest level of the citadel</li>
<li>Margaret thinks she remembers someone who works there?</li>
</ul>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
Things to do
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<ul>
<li>Get in there via Grand Archive connections</li>
<li>Ask about the curse</li>
<li>Ask about memories and the holes they leave</li>
<li>Curse shop</li>
<li>Ask about the house</li>
</ul>
<div id="outline-container-headline-10" class="outline-4">
<h4 id="headline-10">
Sun Orchid
</h4>
<div id="outline-text-headline-10" class="outline-text-4">
<ul>
<li>If we could get a sun orchid elixir, it&#39;d be helpful for Margaret&#39;s project</li>
<li>Issue: They manufacture one every decade or so</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
Black markets
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<ul>
<li>Could we get a Sun Orchid this way?</li>
<li>Constant plans to kidnap the alchemist and get the recipe</li>
<li>Some rumors these attempts are government-sponsored, since the government wants hands on the alchemist who created it</li>
<li>Allegedly there is no elixir formula, since it&#39;d be dangerous. It&#39;s just in the Alchemist&#39;s head.</li>
<li>… Which I can reach into</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-12" class="outline-2">
<h2 id="headline-12">
Thulvia, In The Flesh
</h2>
<div id="outline-text-headline-12" class="outline-text-2">
<ul>
<li>The citadel is not as big as we expect from the outside.</li>
<li>The citadel isn&#39;t bigger on the inside, just underground. And the underground part extends far out, even 30 minutes from the main building we&#39;re still walking around there.</li>
<li>Thulvia is incredibly hot in the summer, underground avoids heat and desert monsters.</li>
<li>Also makes the citadel a better stronghold.</li>
<li>Quest: Get some books on kineticism.</li>
</ul>
<div id="outline-container-headline-13" class="outline-3">
<h3 id="headline-13">
Search list
</h3>
<div id="outline-text-headline-13" class="outline-text-3">
<ul>
<li>Margaret&#39;s friend DONE</li>
<li>Truenames DONE</li>
<li>House IGNORE</li>
<li>Memories EMAILED</li>
<li>Religious Curses TODO (Absalom)</li>
</ul>
</div>
</div>
<div id="outline-container-headline-14" class="outline-3">
<h3 id="headline-14">
Lecture: Truenames
</h3>
<div id="outline-text-headline-14" class="outline-text-3">
<ul>
<li>Eccentric eefrit writing on a chalkboard</li>
<li>Professor Sandbridge</li>
<li>They&#39;ve journeyed across the planes</li>
<li>Words of power: Words that tap into certain aspects of reality, truenames are words of power associated with entities</li>
<li>Where does the power invested in these words come from?</li>
<li>The realm of the fae (realm of the eldest) is where truenames originate</li>
<li>In this realm, words of power are enhanced</li>
<li>Words of Power are restricted to those of extraordinary power in our world, but not in the realm of the fae</li>
<li>If you see your own true name, you will recognise it, even if you don&#39;t know what that means</li>
<li>It&#39;s possible but not likely to learn a truename from reading the mind of someone who knows it</li>
<li>She gave us her mailing adress and a booklist</li>
</ul>
<div id="outline-container-headline-15" class="outline-4">
<h4 id="headline-15">
Finding Out a Truename
</h4>
<div id="outline-text-headline-15" class="outline-text-4">
<ul>
<li>You need to learn your truename to become a Lich</li>
<li>To understand X&#39;s truename - it hinges on X being able to discover their own name</li>
<li>Inscribing your own truename strengthens you by connecting you to the magic of the world.</li>
<li>A word of power is deeper than the lettering. To speak it is to feel at the essence of reality and punch a hole through which to bring that word forth.</li>
<li>Inscribing your name on something is basically keeping that hole open</li>
<li>Some wizards inscribe it inside an arcane focus</li>
<li>Names as a bargaining chip: Devotees of gods will offer up their true name as a show of devotion, which can provide amounts of power, at the risk of a data leak.</li>
<li>Weilding a truename: Exert control, issue commands, cause them to cower in fear, even undo their existence (handcuffs, anyone?)</li>
</ul>
</div>
</div>
<div id="outline-container-headline-16" class="outline-4">
<h4 id="headline-16">
Changing Truenames
</h4>
<div id="outline-text-headline-16" class="outline-text-4">
<ul>
<li>Not something for mere mortals, at least not now.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-17" class="outline-2">
<h2 id="headline-17">
Zyzyx Fuckery
</h2>
<div id="outline-text-headline-17" class="outline-text-2">
<ul>
<li>Heist gone wrong</li>
<li>Stole the ingredients Margaret needed</li>
<li>Including several handheld flammable alchemical reagents (hand grenades)</li>
</ul>
</div>
</div>
<div id="outline-container-headline-18" class="outline-2">
<h2 id="headline-18">
Edalyn and Margaret
</h2>
<div id="outline-text-headline-18" class="outline-text-2">
<ul>
<li>Margaret looks morose</li>
<li>Genevieve was right, it was the alchemist!</li>
<li>It was sad, apparently</li>
<li>But who cares. That will not stop Genevieve from showing off how smart she is. In fact nothing will.</li>
<li>Stimulus like pictures and places will help Margaret recall memories.</li>
<li>Perhaps finding more places she&#39;s been, and/or more of her friends (like the ones she was meant to see at the manor)</li>
</ul>
</div>
</div>
<div id="outline-container-headline-19" class="outline-2">
<h2 id="headline-19">
Ending
</h2>
<div id="outline-text-headline-19" class="outline-text-2">
<ul>
<li>I healed up Iggly (but not Zyzyx)</li>
<li>Character moments of Edalyn making a little mini-bed for Mouse, and Zyzyx giving Mouse a gold coin</li>
</ul>
<div id="outline-container-headline-20" class="outline-3">
<h3 id="headline-20">
More Research
</h3>
<div id="outline-text-headline-20" class="outline-text-3">
<div id="outline-container-headline-21" class="outline-4">
<h4 id="headline-21">
Memories
</h4>
<div id="outline-text-headline-21" class="outline-text-4">
<p>Inspired by realising colleagues and business cards exist, do I have any colleagues/professional acquaintances (in Absalom or in the Citadel) who I could reach out to via mail or whatever about memories?
OOC: If you want me to just drop this line of inquiry or it&#39;s not going anywhere, let me know and I&#39;ll stop being annoying about it.</p>
<ul>
<li>I&#39;m looking into ways to recover pieces of erased memories (analogy: Ways to recover fragments of deleted info off a hard drive)</li>
<li>Cover story: Scouting a future research project.</li>
<li>My recent research was on mental hardening, i.e resisting mental damage, I&#39;m interested in going a step further and undoing it.</li>
<li>This is probably hubris, but I&#39;d love to be able to undo damage caused by religious/divine intervention. If you know anything about how the hell (if you pardon the pun) we could even go about that.</li>
<li>Send them details on the slate from my loredumps</li>
<li>Don&#39;t say I have it, just that I&#39;ve been researching it.</li>
<li>How does thing in particular mess with memories?</li>
<li>
<p>Tell them what I know about the effects of the slate. For instance:</p>
<ul>
<li>Everything I&#39;ve got from loredumps you gave wi</li>
<li>It doesn&#39;t have a <em>complete</em> effect on documents, just on memories</li>
<li>The maker of the wish remembers stuff, it&#39;s possible they can select a few people to remember stuff as well (or perhaps they just tell those people)</li>
<li>It&#39;s been used several times by the same person, which shouldn&#39;t be possible normally. The magic seems saturated.</li>
</ul>
</li>
</ul>
<div id="outline-container-headline-22" class="outline-5">
<h5 id="headline-22">
Actual Letter
</h5>
<div id="outline-text-headline-22" class="outline-text-5">
<p>Hey &lt;Name&gt;,</p>
<p>
Sorry to keep doing this to you, but I got a bug in my brain about a potential research direction and it seems like it&#39;d be up your alley.
I&#39;m looking into ways to recover pieces of erased memories (OOC analogy: Ways to recover fragments of deleted info off a hard drive). My recent research was on mental hardening, i.e resisting mental damage, I&#39;m interested in going a step further and undoing it. Might be a fun research project (and a fun collaboration if you want, once I&#39;m back from sabbatical…)
I&#39;m thinking of basically picking a particular form of memory erasure, and putting together a proof-of-concept exploit that undoes it, even just partially.</p>
<p>
I figure the first step in that is identifying the means by which memories were erased, by examining the holes they left in the brain. Any tips on if this is possible and how you&#39;d do it.
The second probably involves inducing the brain to fill the holes in naturally - exposure to the right stimuli, etc. Are there any reliable or especially effective ways to do this? I remember I read once that smells are especially evocative of memories, but that might just be apocryphal</p>
<p>
This is probably hubris, but I&#39;d love to be able to undo damage caused by religious/divine intervention. If you know anything about how the hell (pardon the pun) we could even go about that.
In particular there&#39;s a sort of &#34;test case&#34; I found that I&#39;m kind of curious about, a religious artifact that rewrites/erases memories. I stumbled across it in a book &lt;cite the book I found in Okenno&gt;, and I&#39;ve been researching how it messes with minds.</p>
<p>
&lt;Send them details on the slate from my loredumps (i.e what you&#39;ve given me from my lore checks. I&#39;m very carefully not mentioning that I have it&gt;
Some other things I know about it:</p>
<ul>
<li>It doesn&#39;t have a <em>complete</em> effect on documents, just on memories</li>
<li>The maker of the wish remembers stuff, it&#39;s possible they can select a few people to remember stuff as well (or perhaps they just tell those people)</li>
<li>This is just a rumor so it could be false (and probably is) but it&#39;s been recently used several times by the same person, which shouldn&#39;t be possible normally.</li>
</ul>
<p>Thanks for putting up with this, I can&#39;t wait to hear what you think.</p>
<p>
PS: I&#39;m kind of away from any good libraries right now - if there are any books you recommend on this could you just send me copies? Send the bill as well, I promise I&#39;ll reimburse you</p>
<p>
Your fellow mad scientist,
Genevieve Cayley</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-23" class="outline-4">
<h4 id="headline-23">
Curses/Religion
</h4>
<div id="outline-text-headline-23" class="outline-text-4">
<ul>
<li>Grandmother Spider: Gaining and losing her favor - how, and what does she do?</li>
<li>If it&#39;s safe, show them the tablet</li>
<li>What is the nature of the curse?</li>
<li>What would happen if someone used this</li>
<li>Removing the curse?</li>
<li>Motivations</li>
<li>Are there layers of manipulations? My hypothesis is that there&#39;s some magical tampering from a talented mortal, and then a curse in response to that. Can you judge from this how likely that is?</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</div>

</content>
<p>
  
</p>




  </main>
  <footer><small>
   | 
</small></footer>

    
</body>

</html>
